snlkuharlocal/src/Documents/ВозвратИМ/ВозвратИМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратИМ</name>
  <registerRecords>AccumulationRegister.ОстаткиТМЦ</registerRecords>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаказИМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИнетЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛогистЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАвизации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>999</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВозвратОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КачествоТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ВозвратИМ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика.  
	Движения.ОстаткиТМЦ.Очистить();
	////Движения.Продажи.Очистить();
	Движения.Записать();
	//
	ЕстьДвижения = Истина;
	////ЕстьДвижения1 = Истина;
	ВидДвиж = ВидДвиженияНакопления.Приход;
    ПД = ПолучитьПД(ДокОснование.КонтрагентДоставки);
	Опер = Перечисления.КодыОперацийОстатки.Перемещение;
	Если ЕстьДвижения Тогда
		Движения.ОстаткиТМЦ.Записывать = Истина;
		
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Если ТекСтрокаТовары.Количество Тогда
				Движение = Движения.ОстаткиТМЦ.Добавить();
				Движение.ВидДвижения = ВидДвиж;
				Движение.Период = Дата;
				Движение.Склад = Склад;
				Движение.Номенклатура = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
				//Движение.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
				Движение.Количество = ТекСтрокаТовары.Количество;
				Движение.КодОперации = Опер;
				Движение.Отправитель = ДокОснование.КонтрагентДоставки;
			КонецЕсли;
		КонецЦикла;
		
		Движения.Записать();
		
	КонецЕсли;
	////Если ЕстьДвижения1 Тогда
	////	Движения.Продажи.Записывать = Истина;
	////	
	////	Для Каждого СтрокаТаблицы Из Товары Цикл
	////		Если СтрокаТаблицы.Количество Тогда
	////			Движение = Движения.Продажи.Добавить();
	////			Движение.Период						= Дата;
	////			Движение.Номенклатура				= СтрокаТаблицы.Номенклатура;
	////			Движение.ХарактеристикаНоменклатуры	= СтрокаТаблицы.ХарактеристикаНоменклатуры;
	////			Движение.Подразделение				= Подразделение;
	////			Движение.КодОперации				= Опер;
	////			Движение.Организация				= Организация;
	////			Движение.Количество					= -СтрокаТаблицы.Количество;
	////			Движение.Оборот_Нац					=  -СтрокаТаблицы.Всего;
	////			ВсегоБезСкидки = ?(ЗначениеЗаполнено(СтрокаТаблицы.ЦенаБезСкидки), СтрокаТаблицы.ЦенаБезСкидки ,СтрокаТаблицы.Цена) * СтрокаТаблицы.Количество;
	////			Движение.ОборотБезСкидки_Нац		=  -ВсегоБезСкидки;
	////			Движение.Скидка_Нац					=  -(ВсегоБезСкидки - СтрокаТаблицы.Всего);
	////		КонецЕсли;
	////	КонецЦикла;
	////	
	////	Движения.Записать();
	////	
	////КонецЕсли;
	//Если ШтрихкодыУпаковок.Количество() Тогда
	//	Маркировка_ПИ.НайтиСоздатьХКМФакт(Ссылка, ШтрихкодыУпаковок.Выгрузить());	
	//КонецЕсли;
КонецПроцедуры

Функция ПолучитьПД(Контра)
	Рез = Неопределено;
	Запр = Новый Запрос;
	Запр.Текст =
	"ВЫБРАТЬ
	|	ПунктыДоставки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПунктыДоставки КАК ПунктыДоставки
	|ГДЕ
	|	ПунктыДоставки.Владелец = &Контра";
	Запр.УстановитьПараметр("Контра", Контра);
	Выб = Запр.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		Рез = Выб.Ссылка;
	КонецЕсли;	
	Возврат Рез;
КонецФункции
